XIVN1987/MCUCode/board_CH32V/CH32V407/src/CSL/Peripheral/ch32v4x7_ltdc.c
    LTDC_Layerx->CFBAR &= ~(LTDC_CFBAR_CFBADD);
    LTDC_Layerx->CFBAR = (LTDC_Layer_InitStruct->LTDC_CFBStartAdress);

    cfbp = (LTDC_Layer_InitStruct->LTDC_CFBPitch << 16);
    LTDC_Layerx->CFBLR &= ~(LTDC_CFBLR_CFBLL | LTDC_CFBLR_CFBP);
    LTDC_Layerx->CFBLR = (LTDC_Layer_InitStruct->LTDC_CFBLineLength | cfbp);

    LTDC_Layerx->CFBLNR &= ~(LTDC_CFBLNR_CFBLNBR);
    LTDC_Layerx->CFBLNR = (LTDC_Layer_InitStruct->LTDC_CFBLineNumber);
}

/*********************************************************************
 * @fn      LTDC_LayerStructInit
 *
 * @brief   Fills each LTDC_Layer_InitStruct member with its default value.
 * 
 * @param   LTDC_Layer_InitStruct - pointer to a LTDC_LayerTypeDef structure which will
 *        be initialized.
 * 
 * @return  none
 */
void LTDC_LayerStructInit(LTDC_Layer_InitTypeDef* LTDC_Layer_InitStruct)
{
    LTDC_Layer_InitStruct->LTDC_HorizontalStart   = 0x00;
    LTDC_Layer_InitStruct->LTDC_HorizontalStop    = 0x00;
    LTDC_Layer_InitStruct->LTDC_VerticalStart     = 0x00;
    LTDC_Layer_InitStruct->LTDC_VerticalStop      = 0x00;
    LTDC_Layer_InitStruct->LTDC_PixelFormat       = LTDC_Pixelformat_ARGB8888;
    LTDC_Layer_InitStruct->LTDC_DefaultColorBlue  = 0x00;
    LTDC_Layer_InitStruct->LTDC_DefaultColorGreen = 0x00;
    LTDC_Layer_InitStruct->LTDC_DefaultColorRed   = 0x00;
    LTDC_Layer_InitStruct->LTDC_DefaultColorAlpha = 0x00;
    LTDC_Layer_InitStruct->LTDC_CFBStartAdress    = 0x00;
    LTDC_Layer_InitStruct->LTDC_CFBLineLength     = 0x00;
    LTDC_Layer_InitStruct->LTDC_CFBPitch          = 0x00;
    LTDC_Layer_InitStruct->LTDC_CFBLineNumber     = 0x00;
}

/*********************************************************************
 * @fn      LTDC_LayerCmd
 *
 * @brief   Enables or disables the LTDC_Layer Controller.
 * 
 * @param   LTDC_layerx - Select the layer to be configured, this parameter can be 
 *        one of the following values: LTDC_Layer1
 *          NewState - ENABLE or DISABLE.
 * 
 * @return  none
 */
void LTDC_LayerCmd(LTDC_Layer_TypeDef* LTDC_Layerx, FunctionalState NewState)
{
    if (NewState != DISABLE)
    {
        LTDC_Layerx->CR |= (uint32_t)LTDC_CR_LEN;
    }
    else
    {
        LTDC_Layerx->CR &= ~(uint32_t)LTDC_CR_LEN;
    }
}

/*********************************************************************
 * @fn      LTDC_GetPosStatus
 *
 * @brief   Get the current position.
 * 
 * @param   LTDC_Pos_InitStruct - pointer to a LTDC_PosTypeDef structure that contains
 *        the current position.
 * 
 * @return  none
 */
LTDC_PosTypeDef *LTDC_GetPosStatus(LTDC_PosTypeDef *LTDC_Pos_Struct)
{
    LTDC->CPSR &= ~(LTDC_CPSR_CYPOS | LTDC_CPSR_CXPOS);

    LTDC_Pos_Struct->LTDC_POSX = (uint32_t)(LTDC->CPSR >> 16);
    LTDC_Pos_Struct->LTDC_POSY = (uint32_t)(LTDC->CPSR & 0xFFFF);

    return LTDC_Pos_Struct;
}

/*********************************************************************
 * @fn      LTDC_PosStructInit
 *
 * @brief   Fills each LTDC_Pos_InitStruct member with its default value.
 * 
 * @param   LTDC_Pos_InitStruct - pointer to a LTDC_PosTypeDef structure which will
 *        be initialized.
 * 
 * @return  none
 */
void LTDC_PosStructInit(LTDC_PosTypeDef* LTDC_Pos_InitStruct)
{
    LTDC_Pos_InitStruct->LTDC_POSX = 0x00;
    LTDC_Pos_InitStruct->LTDC_POSY = 0x00;
}

/*********************************************************************
 * @fn      LTDC_GetCDStatus
 *
 * @brief   Checks whether the specified LTDC's flag is set or not.
 * 
 * @param   LTDC_CD - specifies the flag to check.
 *        This parameter can be one of the following values:
 *            LTDC_CD_VDES - vertical data enable current status.
 *            LTDC_CD_HDES - horizontal data enable current status.
 *            LTDC_CD_VSYNC -  Vertical Synchronization current status.
 *            LTDC_CD_HSYNC -  Horizontal Synchronization current status.
 * 
 * @return  The new state of LTDC_CD (SET or RESET).
 */
FlagStatus LTDC_GetCDStatus(uint32_t LTDC_CD)
{
    FlagStatus bitstatus;

    if ((LTDC->CDSR & LTDC_CD) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}

/*********************************************************************
 * @fn      LTDC_ColorKeyingConfig
 *
 * @brief   Set and configure the color keying.
 * 
 * @param   LTDC_colorkeying_InitStruct - pointer to a LTDC_ColorKeying_InitTypeDef 
 *        structure that contains the color keying configuration.
 *          LTDC_layerx - Select the layer to be configured, this parameter can be 
 *        one of the following values: LTDC_Layer1   
 * 
 * @return  none
 */
void LTDC_ColorKeyingConfig(LTDC_Layer_TypeDef* LTDC_Layerx, LTDC_ColorKeying_InitTypeDef* LTDC_colorkeying_InitStruct, FunctionalState NewState)
{
    uint32_t ckgreen = 0;
    uint32_t ckred   = 0;

    if (NewState != DISABLE)
    {
        LTDC_Layerx->CR |= (uint32_t)LTDC_CR_COLKEN;

        ckgreen = (LTDC_colorkeying_InitStruct->LTDC_ColorKeyGreen << 8);
        ckred   = (LTDC_colorkeying_InitStruct->LTDC_ColorKeyRed << 16);
        LTDC_Layerx->CKCR &= ~(LTDC_CKCR_CKBLUE | LTDC_CKCR_CKGREEN | LTDC_CKCR_CKRED);
        LTDC_Layerx->CKCR |= (LTDC_colorkeying_InitStruct->LTDC_ColorKeyBlue | ckgreen | ckred);
    }
    else
    {
        LTDC_Layerx->CR &= ~(uint32_t)LTDC_CR_COLKEN;
    }

    LTDC->SRCR = LTDC_IMReload;
}

/*********************************************************************
 * @fn      LTDC_ColorKeyingStructInit
 *
 * @brief   Fills each LTDC_colorkeying_InitStruct member with its default value.
 * 
 * @param   LTDC_colorkeying_InitStruct - pointer to a LTDC_ColorKeying_InitTypeDef structure which will
 *        be initialized.
 * 
 * @return  none
 */
void LTDC_ColorKeyingStructInit(LTDC_ColorKeying_InitTypeDef* LTDC_colorkeying_InitStruct)
{
    LTDC_colorkeying_InitStruct->LTDC_ColorKeyBlue  = 0x00;
    LTDC_colorkeying_InitStruct->LTDC_ColorKeyGreen = 0x00;
    LTDC_colorkeying_InitStruct->LTDC_ColorKeyRed   = 0x00;
}

/*********************************************************************
 * @fn      LTDC_CLUTCmd
 *
 * @brief   Enables or disables CLUT.
 * 
 * @param   NewState - ENABLE or DISABLE.
 *          LTDC_layerx - Select the layer to be configured, this parameter can be 
 *        one of the following values: LTDC_Layer1  
 * 
 * @return  none
 */
void LTDC_CLUTCmd(LTDC_Layer_TypeDef* LTDC_Layerx, FunctionalState NewState)
{
    if (NewState != DISABLE)
    {
        LTDC_Layerx->CR |= (uint32_t)LTDC_CR_CLUTEN;
    }
    else
    {
        LTDC_Layerx->CR &= ~(uint32_t)LTDC_CR_CLUTEN;
    }

